namespace Students.Models;

/// <summary>
/// Тип финансирования
/// </summary>
/// 
///За счет бюджетных ассигнований федерального бюджета
///За счет бюджетных ассигнований бюджетов субъектов РФ
///За счет бюджетных ассигнований местных бюджетов
///По договорам за счет средств физических лиц
///По договорам за счет средств юридических лиц
///За счет собственных средств организации
public class FinancingType
{
    /// <summary>
    /// Id типа финансирования
    /// </summary>
    public Guid Id { get; set; }
    /// <summary>
    /// Имя типа финансирования
    /// </summary>
    public string? SourceName { get; set; }
}